# Prueba

In [144]:
import psycopg2 # Se conecta a postgre
import pandas.io.sql as pdsql # transforma las salidas de postgre en formato pandas dataframe
import warnings
import pandas as pd
warnings.filterwarnings("ignore")

In [145]:
clave = 'XXXXX'

In [146]:
psycopg2.connect(user = 'postgres', password = clave, host = '127.0.0.1', port = 5433, database = 'classicmodels')

In [147]:
def conexion_bbdd(user, passw, database):
    connection = psycopg2.connect(user =user,
                                 password = passw,
                                 host = '127.0.0.1',
                                 port = 5433,
                                 database = database)
    return connection

In [148]:
conexion_bbdd(user = 'postgres', passw = clave, database = 'classicmodels')

pdsql.read_sql_query('SELECT * FROM public.categories', conexion_bbdd(user = 'postgres', passw = clave, database = 'northwind'))

In [149]:
def lectura_bbdd(clave, query):

    df = pdsql.read_sql_query(query,
                              conexion_bbdd(user = 'postgres', passw = clave, database = 'classicmodels '))

    return df

In [150]:
def leer_tabla(tabla, engine):

    df = pdsql.read_sql_query(query,
                              conexion_bbdd(user = 'postgres', passw = clave, database = 'classicmodels '))

    return df

## 1. Genera una función llamada leer_tabla(tabla, engine) y utilízala para leer tablas
## completas desde la base de datos en dataframes independientes. Utilizando esta
## función, importa las siguientes tablas:
## - order
## - orderdetails
## - customers
## - products
## - employees

In [151]:
#def conexion_bbdd(user, passw, database):
engine = psycopg2.connect(user ='postgres',
                                 password = clave,
                                 host = '127.0.0.1',
                                 port = 5433,
                                 database = 'classicmodels')

In [152]:
def leer_tabla(tabla, engine):

    df = pdsql.read_sql_query(f"SELECT * FROM {tabla}", engine)

    return df

In [153]:
leer_tabla('orders',engine)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,None,141
...,...,...,...,...,...,...,...
647,10421,2005-05-29,2005-06-06,None,In Process,Custom shipping instructions were sent to ware...,124
648,10422,2005-05-30,2005-06-11,None,In Process,None,157
649,10423,2005-05-30,2005-06-05,None,In Process,None,314
650,10424,2005-05-31,2005-06-08,None,In Process,None,141
651,10425,2005-05-31,2005-06-07,None,In Process,None,119

In [154]:
df_orders = leer_tabla('orders',engine)
df_orderdetails = leer_tabla('orderdetails',engine)
df_customers = leer_tabla('customers',engine)
df_products = leer_tabla('products',engine)
df_employees = leer_tabla('employees',engine)

In [155]:
df_orders.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,None,141

In [156]:
df_orders[df_orders['orderNumber'] == 10100]

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
328,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363

In [157]:
df_orders.orderNumber.value_counts()

10100    2
10304    2
10322    2
10321    2
10320    2
        ..
10206    2
10205    2
10204    2
10203    2
10425    2
Name: orderNumber, Length: 326, dtype: int64

In [158]:
# Count duplicates and drop them temporarily
df_orders_unq = df_orders.drop_duplicates()
df_orders_unq.shape

(326, 7)

In [159]:
df_orders_unq.head(3)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181

In [160]:
df_orderdetails.head()

   orderNumber productCode  quantityOrdered  priceEach  orderLineNumber
0        10100    S18_1749               30     136.00                3
1        10100    S18_2248               50      55.09                2
2        10100    S18_4409               22      75.46                4
3        10100    S24_3969               49      35.29                1
4        10101    S18_2325               25     108.06                4

In [161]:
df_customers.head(3)

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.0

In [162]:
df_customers.customerNumber.value_counts()
df_customers[df_customers['customerNumber'] == 103]

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.0
122,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.0

In [163]:
# Count duplicates and drop them temporarily

df_customers.rename(columns={'salesRepEmployeeNumber': 'employeeNumber'}, inplace=True)
df_customers_unq = df_customers.drop_duplicates()
df_customers_unq.shape

(122, 13)

In [164]:
df_products.head(3)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30
2,S10_2016,1996 Moto Guzzi 1100i,Motorcycles,1:10,Highway 66 Mini Classics,"Official Moto Guzzi logos and insignias, saddl...",6625,68.99,118.94

In [172]:
df_products_unq = df_products.drop_duplicates()
df_products_unq.shape

(110, 9)

In [178]:
df_employees.head(3)
df_employees_unq = df_employees.drop_duplicates()
df_employees_unq.shape

(23, 8)

## 2. Realiza el cruce entre los DataFrames, asegurándote de utilizar correctamente el
## parámetro validate para asegurar la integridad referencial.

In [166]:
df_base = df_orders_unq.merge(df_orderdetails, on='orderNumber', how='left', validate='1:m') 
print(df_base.shape)

(5992, 11)

In [174]:
df_base = df_base.merge(df_products_unq, on='productCode', how='left', validate='m:1') 
print(df_base.shape)

(5992, 43)

In [175]:
df_base = df_base.merge(df_customers_unq, on='customerNumber', how='left', validate='m:1')
print(df_base.shape)

(5992, 55)

In [181]:
df_base = df_base.merge(df_employees_unq, on='employeeNumber', how='left', validate='m:1')
print(df_base.shape)

(5992, 62)

In [182]:
df_base.columns

Index(['orderNumber', 'orderDate', 'requiredDate', 'shippedDate', 'status',
       'comments', 'customerNumber', 'productCode', 'quantityOrdered',
       'priceEach', 'orderLineNumber', 'customerName_x', 'contactLastName_x',
       'contactFirstName_x', 'phone_x', 'addressLine1_x', 'addressLine2_x',
       'city_x', 'state_x', 'postalCode_x', 'country_x', 'employeeNumber_x',
       'creditLimit_x', 'customerName_y', 'contactLastName_y',
       'contactFirstName_y', 'phone_y', 'addressLine1_y', 'addressLine2_y',
       'city_y', 'state_y', 'postalCode_y', 'country_y', 'employeeNumber_y',
       'creditLimit_y', 'productName', 'productLine', 'productScale',
       'productVendor', 'productDescription', 'quantityInStock', 'buyPrice',
       'MSRP', 'customerName', 'contactLastName', 'contactFirstName', 'phone',
       'addressLine1', 'addressLine2', 'city', 'state', 'postalCode',
       'country', 'employeeNumber', 'creditLimit', 'lastName', 'firstName',
       'extension', 'email', 'officeCode', 'reportsTo', 'jobTitle'],
      dtype='object')

# 3. Agrega las siguientes columnas, considerando su nombre y la fórmula asociada
## - venta: quantityOrdered*priceEach
## - costo: quantityOrdered*buyPrice
## - ganancia: considerando las columnas anteriores

In [184]:
df_base['venta'] = df_base['quantityOrdered'] * df_base['priceEach']
df_base['costo'] = df_base['quantityOrdered'] * df_base['buyPrice']
df_base['ganancia'] = df_base['venta'] - df_base['costo']

In [186]:
df_base.columns

Index(['orderNumber', 'orderDate', 'requiredDate', 'shippedDate', 'status',
       'comments', 'customerNumber', 'productCode', 'quantityOrdered',
       'priceEach', 'orderLineNumber', 'customerName_x', 'contactLastName_x',
       'contactFirstName_x', 'phone_x', 'addressLine1_x', 'addressLine2_x',
       'city_x', 'state_x', 'postalCode_x', 'country_x', 'employeeNumber_x',
       'creditLimit_x', 'customerName_y', 'contactLastName_y',
       'contactFirstName_y', 'phone_y', 'addressLine1_y', 'addressLine2_y',
       'city_y', 'state_y', 'postalCode_y', 'country_y', 'employeeNumber_y',
       'creditLimit_y', 'productName', 'productLine', 'productScale',
       'productVendor', 'productDescription', 'quantityInStock', 'buyPrice',
       'MSRP', 'customerName', 'contactLastName', 'contactFirstName', 'phone',
       'addressLine1', 'addressLine2', 'city', 'state', 'postalCode',
       'country', 'employeeNumber', 'creditLimit', 'lastName', 'firstName',
       'extension', 'email', 'officeCode', 'reportsTo', 'jobTitle', 'venta',
       'costo', 'ganancia'],
      dtype='object')

## 4. ¿Cuál fue el total de ventas por línea de productos? Incluye una fila de totales.

In [199]:
# Agrupar por línea de productos y sumar las ventas
total_ventas_por_linea = df_base.groupby('productLine')['venta'].sum().reset_index(name='total_ventas')

# Agregar una columna de totales al DataFrame original
df_base = pd.merge(df_base, total_ventas_por_linea, on='productLine', how='left')
print(f"total de ventas por linea de productos: {total_ventas_por_linea}")

total de ventas por linea de productos:         productLine  total_ventas
0      Classic Cars    7707844.98
1       Motorcycles    2242852.24
2            Planes    1909275.08
3             Ships    1327996.68
4            Trains     377065.84
5  Trucks and Buses    2048227.14
6      Vintage Cars    3595119.26

In [195]:
df_base.columns

Index(['orderNumber', 'orderDate', 'requiredDate', 'shippedDate', 'status',
       'comments', 'customerNumber', 'productCode', 'quantityOrdered',
       'priceEach', 'orderLineNumber', 'customerName_x', 'contactLastName_x',
       'contactFirstName_x', 'phone_x', 'addressLine1_x', 'addressLine2_x',
       'city_x', 'state_x', 'postalCode_x', 'country_x', 'employeeNumber_x',
       'creditLimit_x', 'customerName_y', 'contactLastName_y',
       'contactFirstName_y', 'phone_y', 'addressLine1_y', 'addressLine2_y',
       'city_y', 'state_y', 'postalCode_y', 'country_y', 'employeeNumber_y',
       'creditLimit_y', 'productName', 'productLine', 'productScale',
       'productVendor', 'productDescription', 'quantityInStock', 'buyPrice',
       'MSRP', 'customerName', 'contactLastName', 'contactFirstName', 'phone',
       'addressLine1', 'addressLine2', 'city', 'state', 'postalCode',
       'country', 'employeeNumber', 'creditLimit', 'lastName', 'firstName',
       'extension', 'email', 'officeCode', 'reportsTo', 'jobTitle', 'venta',
       'costo', 'ganancia', 'total_ventas'],
      dtype='object')

## 5. ¿Cuántos clientes distintos hicieron compras?

In [197]:
#df_base ya está definido y cargado con datos
clientes_diferentes = df_base['customerName'].nunique()
print(f"Número de clientes diferentes que hicieron compras: {clientes_diferentes}")

Número de clientes diferentes que hicieron compras: 98

## 6. ¿Existen clientes que aún no han hecho ninguna compra? ¿Cuántos son?

In [201]:
clientes_sin_compras = df_base[df_base['venta'].isnull() | (df_base['venta'] == 0)]

if clientes_sin_compras.empty:
    print("Todos los clientes han realizado compras.")
else:
    print("Existen clientes que aún no han hecho ninguna compra.")

# Para determinar cuántos son:
cantidad_clientes_sin_compras = len(clientes_sin_compras)
print(f"Número de clientes sin compras: {cantidad_clientes_sin_compras}")

Todos los clientes han realizado compras.
Número de clientes sin compras: 0

## ¿Cuáles fueron los 10 clientes que reportan mayores ventas brutas en dinero durante
## el año 2005? Genera un DataFrame y guárdalo en una tabla de Postgre llamada
## top_10_clientes_2005, en la que se especifique el nombre del cliente y su
## correspondiente venta, costo y ganancia.

In [213]:

df_base['orderDate'] = pd.to_datetime(df_base['orderDate']) #Convierte orderDate en datetime 
df_2005 = df_base[df_base['orderDate'].dt.year == 2005] # Filtra la data del 2005

# Calculo de  total_sales, total_cost y total_profit de cada customerName
df_customer_totals = df_2005.groupby('customerName').agg( 
    total_sales=pd.NamedAgg(column='venta', aggfunc='sum'),
    total_cost=pd.NamedAgg(column='costo', aggfunc='sum'),
    total_profit=pd.NamedAgg(column='ganancia', aggfunc='sum')
).reset_index()

df_customer_totals.sort_values(by='total_sales', ascending=False, inplace=True) # Ordena el df descendente
top_10_customers = df_customer_totals.head(10) # Selecciona los 10 superiores

# Coneccion a PostgreSQL y guarda el df en una tabla
conn = psycopg2.connect(user = 'postgres', password = clave, host = '127.0.0.1', port = 5433, database = 'classicmodels')

# Crea un cursor para modificar la db
cur = conn.cursor()
# Crea la tabla top_10_clientes_2005
cur.execute("""
    CREATE TABLE IF NOT EXISTS top_10_clientes_2005 (
        customerName VARCHAR,
        total_sales NUMERIC,
        total_cost NUMERIC,
        total_profit NUMERIC
    )
""")
# Carga la tabla desde top_10_customers
for _, row in top_10_customers.iterrows():
    cur.execute("""
        INSERT INTO top_10_clientes_2005 (customerName, total_sales, total_cost, total_profit)
        VALUES (%s, %s, %s, %s)
    """, (row['customerName'], row['total_sales'], row['total_cost'], row['total_profit']))
# Commit para guardar y cerrar
conn.commit()
conn.close()
# Print los top 10 customers
print(top_10_customers)

                    customerName  total_sales  total_cost  total_profit
12        Euro+ Shopping Channel    580037.04   339979.94     240057.10
27  Mini Gifts Distributors Ltd.    384963.46   230169.44     154794.02
21             La Rochelle Gifts    182294.22   111054.08      71240.14
39     The Sharp Gifts Warehouse    167969.78   101686.04      66283.74
10    Down Under Souveniers, Inc    150040.26    92779.04      57261.22
1        Anna's Decorations, Ltd    113864.60    70829.80      43034.80
33         Salzburg Collectables    104840.14    67072.52      37767.62
16             Gifts4AllAges.com    101613.70    66442.50      35171.20
7       Corporate Gift Ideas Co.     93563.32    57122.62      36440.70
28       Oulu Toy Supplies, Inc.     93541.04    54987.22      38553.82

In [214]:

df_2005 = df_base[df_base['orderDate'].dt.year == 2005] # Filtra la data del 2005

# Calculo de  total_sales, total_cost y total_profit de cada product
df_product_totals = df_2005.groupby('productName').agg(
    total_sales=pd.NamedAgg(column='venta', aggfunc='sum'),
    total_cost=pd.NamedAgg(column='costo', aggfunc='sum'),
    total_profit=pd.NamedAgg(column='ganancia', aggfunc='sum')
).reset_index()

df_product_totals.sort_values(by='total_sales', ascending=False, inplace=True)  # Ordena el df descendente

top_10_products = df_product_totals.head(10) # Selecciona los 10 superiores

# Coneccion a PostgreSQL y guarda el df en una tabla
conn = psycopg2.connect(user = 'postgres', password = clave, host = '127.0.0.1', port = 5433, database = 'classicmodels')

# Crea un cursor para modificar la db
cur = conn.cursor()
# Crea la tabla
cur.execute("""
    CREATE TABLE IF NOT EXISTS top_10_productos_2005 (
        productName VARCHAR,
        total_sales NUMERIC,
        total_cost NUMERIC,
        total_profit NUMERIC
    )
""")

# Carga la tabla desde top_10_products
for _, row in top_10_products.iterrows():
    cur.execute("""
        INSERT INTO top_10_productos_2005 (productName, total_sales, total_cost, total_profit)
        VALUES (%s, %s, %s, %s)
    """, (row['productName'], row['total_sales'], row['total_cost'], row['total_profit']))

# Commit para guardar y cerrar
conn.commit()
conn.close()

# Print los top 10 customers
print(top_10_products)

                             productName  total_sales  total_cost  \
76           1992 Ferrari 360 Spider red    105956.56    54062.60
91  2003 Harley-Davidson Eagle Drag Bike     69712.24    38046.36
36              1952 Alpine Renault 1300     68074.40    34305.84
55                     1968 Ford Mustang     63399.02    34322.40
39               1956 Porsche 356A Coupe     62864.28    50133.00
89                      2002 Suzuki XREO     60868.18    30616.74
58                    1969 Dodge Charger     59134.54    31949.12
83                     1997 BMW R 1100 S     57495.38    32986.12
9               1917 Grand Touring Sedan     55661.40    32772.60
67                   1972 Alfa Romeo GTA     54451.68    37356.48

    total_profit
76      51893.96
91      31665.88
36      33768.56
55      29076.62
39      12731.28
89      30251.44
58      27185.42
83      24509.26
9       22888.80
67      17095.20